# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [2]:
drinks = pd.read_csv(
    'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
)

### Step 4. Which continent drinks more beer on average?

In [6]:
drinks.groupby(
    'continent'
).agg(
    {'beer_servings': 'sum'},
)

           beer_servings
continent
AF                  3258
AS                  1630
EU                  8720
OC                  1435
SA                  2101

### Step 5. For each continent print the statistics for wine consumption.

In [9]:
drinks.groupby(
    'continent'
).wine_servings.agg(
    ['sum', 'min', 'max', 'median']
)

            sum  min  max  median
continent
AF          862    0  233     2.0
AS          399    0  123     1.0
EU         6400    0  370   128.0
OC          570    0  212     8.5
SA          749    1  221    12.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [10]:
drinks.groupby(
    'continent'
).agg(
    'mean'
)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [12]:
drinks.groupby(
    'continent'
).agg(
    'median'
)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [14]:
drinks.groupby(
    'continent'
).spirit_servings.agg(
    ['mean', 'min', 'max']
)

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302